Revit 2027 API
IFCData.CreateBinary Method
 Creates a binary data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateBinary(
	string value
)
Public Shared Function CreateBinary (
	value As String
) As IFCData
public:
static IFCData^ CreateBinary(
	String^ value
)
static member CreateBinary :
        value : string -> IFCData
Parameters
value String
 The string value.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace